In [2]:
import pandas as pd 
import numpy as np 
# from sklearn

In [3]:
df=pd.read_csv(r"E:\ML-Algos\naive_bayes\titanic.csv")
df.head(7)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [4]:
data=df.drop(["Embarked","Cabin","Cabin","Parch","SibSp","Name","PassengerId"],axis="columns")

In [5]:
data.head()

   Survived  Pclass     Sex   Age            Ticket     Fare
0         0       3    male  22.0         A/5 21171   7.2500
1         1       1  female  38.0          PC 17599  71.2833
2         1       3  female  26.0  STON/O2. 3101282   7.9250
3         1       1  female  35.0            113803  53.1000
4         0       3    male  35.0            373450   8.0500

In [19]:
input=data.drop(["Ticket"],axis="columns")
input.head(5)

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [20]:
input=data.drop(["Survived"],axis="columns")
input.head(5)

   Pclass     Sex   Age            Ticket     Fare
0       3    male  22.0         A/5 21171   7.2500
1       1  female  38.0          PC 17599  71.2833
2       3  female  26.0  STON/O2. 3101282   7.9250
3       1  female  35.0            113803  53.1000
4       3    male  35.0            373450   8.0500

In [22]:
input=input.drop(["Ticket",],axis="columns")
input.head(5)

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [7]:
target=data.Survived
target.head(5)

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [8]:
dummies=pd.get_dummies(input.Sex)
dummies.head(5)

   female   male
0   False   True
1    True  False
2    True  False
3    True  False
4   False   True

In [10]:
dummies=dummies.astype(int)
dummies.head(5)

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [23]:
input=pd.concat([input,dummies],axis="columns")
input.head(5)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [24]:
input=input.drop(["Sex"],axis="columns")
input.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [25]:
input.isnull().sum()

Pclass      0
Age       177
Fare        0
female      0
male        0
dtype: int64

In [26]:
input.Age=input.Age.fillna(input.Age.mean())

In [27]:
input.isnull().sum()

Pclass    0
Age       0
Fare      0
female    0
male      0
dtype: int64

In [28]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test=train_test_split(input,target,test_size=.33)

In [29]:
len(X_test)

295

In [30]:
len(X_train)

596

In [31]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [32]:
model.fit(X_train,y_train)

GaussianNB()

In [33]:
model.score(X_test,y_test)

0.7762711864406779

In [34]:
X_test[:10]

     Pclass        Age     Fare  female  male
615       2  24.000000  65.0000       1     0
867       1  31.000000  50.4958       0     1
799       3  30.000000  24.1500       1     0
535       2   7.000000  26.2500       1     0
303       2  29.699118  12.3500       1     0
831       2   0.830000  18.7500       0     1
890       3  32.000000   7.7500       0     1
119       3   2.000000  31.2750       1     0
112       3  22.000000   8.0500       0     1
249       2  54.000000  26.0000       0     1

In [35]:
y_test[:10]

615    1
867    0
799    0
535    1
303    1
831    1
890    0
119    0
112    0
249    0
Name: Survived, dtype: int64

In [36]:
model.predict(X_test[:10])

array([1, 0, 1, 1, 1, 0, 0, 1, 0, 0], dtype=int64)

In [37]:
model.predict_proba(X_test[:10])

array([[0.01234158, 0.98765842],
       [0.84140881, 0.15859119],
       [0.11807045, 0.88192955],
       [0.02955101, 0.97044899],
       [0.05645265, 0.94354735],
       [0.95284827, 0.04715173],
       [0.99156522, 0.00843478],
       [0.04804467, 0.95195533],
       [0.99059384, 0.00940616],
       [0.97078204, 0.02921796]])